Revit 2026 API
LogicalAndFilter Constructor
Overload List
Name | Description
LogicalAndFilter(IList<ElementFilter>) | Initializes a new instance of the LogicalAndFilter class
LogicalAndFilter(ElementFilter, ElementFilter) |  Constructs a new instance of the logical filter with two input filters.
Top
See Also
Reference
LogicalAndFilter Class
Autodesk.Revit.DB Namespace